Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 1591, 300)         15847800  
_________________________________________________________________
conv1d (Conv1D)              (None, 1587, 128)         192128    
_________________________________________________________________
global_max_pooling1d (Global (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 10)                1290      
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 55        
=================================================================
Total params: 16,041,273
Trainable params: 193,473
Non-trainable params: 15,847,800
_________________________________________________________________
