Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 1591, 100)         5282600   
_________________________________________________________________
conv1d (Conv1D)              (None, 1587, 128)         64128     
_________________________________________________________________
global_max_pooling1d (Global (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 10)                1290      
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 55        
=================================================================
Total params: 5,348,073
Trainable params: 65,473
Non-trainable params: 5,282,600
_________________________________________________________________
